package org

//颜色输出
def PrintMes(value,color){
    colors = ['hong'   : "\033[107;91m >>>>>>>>>>>${value}<<<<<<<<<<< \033[0m",
              'lv'  : "\033[107;92m >>>>>>>>>>>${value}<<<<<<<<<<< \033[0m",
              'huang' : "\033[107;93m >>>>>>>>>>>${value}<<<<<<<<<<< \033[0m" ],
              'lan' : "\033[107;94m >>>>>>>>>>>${value}<<<<<<<<<<< \033[0m" ],
              'fen' : "\033[107;95m >>>>>>>>>>>${value}<<<<<<<<<<< \033[0m" ],
              'qing' : "\033[107;96m >>>>>>>>>>>${value}<<<<<<<<<<< \033[0m" ]
    ansiColor('xterm') {
        println(colors[color])
    }
}
